Revit 2027 API
BuiltInFailures.AnalyticalModelFailures.SupportCheckDone Property
 Member support check is complete. No unsupported elements detected.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId SupportCheckDone { get; }
Public Shared ReadOnly Property SupportCheckDone As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ SupportCheckDone {
	FailureDefinitionId^ get ();
}
static member SupportCheckDone : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.AnalyticalModelFailures Class
Autodesk.Revit.DB Namespace